<?php
// 提示消息

if(!function_exists('MG')){
    function MG($code = 0)
    {
        $message =  [
            // 基础参数返回值
            '200' => '成功',
            '0'   => '失败',
            '500' => '服务器异常',
            '404' => '找不到该方法',


            // 用户相关
            '100001' => '用户名不能为空',
            '100002' => '密码不能为空',
            '100003' => '用户不存在',
            '100004' => '请输入菜单名称',
            '100005' => '请选择上级菜单',
            '100006' => '请输入菜单图标',
            '100007' => '请选择打开方式',
            '100008' => '请输入路由',
            '100009' => '请选择正确的状态',
        ];
        return $message[$code];
    }
}